zhuguang-ZFG/Grbl_Esp32/Grbl_Esp32/src/WebUI/WebServer.cpp
    //direct SD files list//////////////////////////////////////////////////
    void Web_Server::handle_direct_SDFileList() {
        //this is only for admin and user
        if (is_authenticated() == AuthenticationLevel::LEVEL_GUEST) {
            _upload_status = UploadStatusType::NONE;
            _webserver->send(401, "application/json", "{\"status\":\"Authentication failed!\"}");
            return;
        }

        String path    = "/";
        String sstatus = "Ok";
        if ((_upload_status == UploadStatusType::FAILED) || (_upload_status == UploadStatusType::FAILED)) {
            sstatus        = "Upload failed";
        }
        _upload_status = UploadStatusType::NONE;
        bool     list_files = true;
        uint64_t totalspace = 0;
        uint64_t usedspace  = 0;
        SDState  state      = get_sd_state(true);
        if (state != SDState::Idle) {
            String status = "{\"status\":\"";
            status += state == SDState::NotPresent ? "No SD Card\"}" : "Busy\"}";
            _webserver->sendHeader("Cache-Control", "no-cache");
            _webserver->send(200, "application/json", status);
            return;
        }
        set_sd_state(SDState::BusyParsing);

        //get current path
        if (_webserver->hasArg("path")) {
            path += _webserver->arg("path");
        }

        //to have a clean path
        path.trim();
        path.replace("//", "/");
        if (path[path.length() - 1] != '/') {
            path += "/";
        }
        // Reject ".." in directory path before list/delete/mkdir (same helper as SD upload).
        if (path_is_traversal(path)) {
            set_sd_state(SDState::Idle);
            SD.end();
            _webserver->send(403, "application/json", "{\"status\":\"Forbidden: path traversal not allowed\"}");
            return;
        }
        //check if query need some action
        if (_webserver->hasArg("action")) {
            //delete a file
            if (_webserver->arg("action") == "delete" && _webserver->hasArg("filename")) {
                String filename;
                String shortname = _webserver->arg("filename");
                filename         = path + shortname;
                shortname.replace("/", "");
                filename.replace("//", "/");
                if (path_is_traversal(filename) || shortname == ".." || shortname.indexOf("..") >= 0) {
                    sstatus = "Forbidden: path traversal not allowed";
                } else if (!SD.exists(filename)) {
                    sstatus = shortname + " does not exist!";
                } else {
                    if (SD.remove(filename)) {
                        sstatus = shortname + " deleted";
                    } else {
                        sstatus = "Cannot deleted ";
                        sstatus += shortname;
                    }
                }
            }
            //delete a directory
            if (_webserver->arg("action") == "deletedir" && _webserver->hasArg("filename")) {
                String filename;
                String shortname = _webserver->arg("filename");
                shortname.replace("/", "");
                filename = path + "/" + shortname;
                filename.replace("//", "/");
                if (path_is_traversal(filename) || shortname == ".." || shortname.indexOf("..") >= 0) {
                    sstatus = "Forbidden: path traversal not allowed";
                } else if (filename != "/") {
                    if (!SD.exists(filename)) {
                        sstatus = shortname + " does not exist!";
                    } else {
                        if (!deleteRecursive(filename)) {
                            sstatus = "Error deleting: ";
                            sstatus += shortname;
                        } else {
                            sstatus = shortname;
                            sstatus += " deleted";
                        }
                    }
                } else {
                    sstatus = "Cannot delete root";
                }
            }
            //create a directory
            if (_webserver->arg("action") == "createdir" && _webserver->hasArg("filename")) {
                String filename;
                String shortname = _webserver->arg("filename");
                filename         = path + shortname;
                shortname.replace("/", "");
                filename.replace("//", "/");
                if (path_is_traversal(filename) || shortname == ".." || shortname.indexOf("..") >= 0) {
                    sstatus = "Forbidden: path traversal not allowed";
                } else if (SD.exists(filename)) {
                    sstatus = shortname + " already exists!";
                } else {
                    if (!SD.mkdir(filename)) {
                        sstatus = "Cannot create ";
                        sstatus += shortname;
                    } else {
                        sstatus = shortname + " created";
                    }
                }
            }
        }
        //check if no need build file list
        if (_webserver->hasArg("dontlist") && _webserver->arg("dontlist") == "yes") {
            list_files = false;
        }

        // TODO Settings - consider using the JSONEncoder class
        String jsonfile = "{";
        jsonfile += "\"files\":[";

        if (path != "/") {
            path = path.substring(0, path.length() - 1);
        }
        if (path != "/" && !SD.exists(path)) {
            String s = "{\"status\":\" ";
            s += path;
            s += " does not exist on SD Card\"}";
            _webserver->send(200, "application/json", s);
            SD.end();
            set_sd_state(SDState::Idle);
            return;
        }
        if (list_files) {
            File dir = SD.open(path);
            if (!dir.isDirectory()) {
                dir.close();
            }
            dir.rewindDirectory();
            File entry = dir.openNextFile();
            int  i     = 0;
            while (entry) {
                COMMANDS::wait(1);
                if (i > 0) {
                    jsonfile += ",";
                }
                jsonfile += "{\"name\":\"";
                String tmpname = entry.name();
                int    pos     = tmpname.lastIndexOf("/");
                tmpname        = tmpname.substring(pos + 1);
                jsonfile += tmpname;
                jsonfile += "\",\"shortname\":\"";  //No need here
                jsonfile += tmpname;
                jsonfile += "\",\"size\":\"";
                if (entry.isDirectory()) {
                    jsonfile += "-1";
                } else {
                    // files have sizes, directories do not
                    jsonfile += ESPResponseStream::formatBytes(entry.size());
                }
                jsonfile += "\",\"datetime\":\"";
                //TODO - can be done later
                jsonfile += "\"}";
                i++;
                entry.close();
                entry = dir.openNextFile();
            }
            dir.close();
        }
        jsonfile += "],\"path\":\"";
        jsonfile += path + "\",";
        jsonfile += "\"total\":\"";
        String stotalspace, susedspace;
        //SDCard are in GB or MB but no less
        totalspace  = SD.totalBytes();
        usedspace   = SD.usedBytes();
        stotalspace = ESPResponseStream::formatBytes(totalspace);
        susedspace  = ESPResponseStream::formatBytes(usedspace + 1);

